Revit 2024 API
BuiltInFailures.OverlapFailures.AreaBoundaryLinesOverlap Property
 Highlighted area boundary lines overlap. Color fills, area tags, and areas may not behave correctly.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId AreaBoundaryLinesOverlap { get; }
Visual Basic
Public Shared ReadOnly Property AreaBoundaryLinesOverlap As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ AreaBoundaryLinesOverlap {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.OverlapFailures Class
Autodesk.Revit.DB Namespace